### Terraform Initialization `success`

### Terraform Validation `success`

<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

### Terraform Plan `success`

<details><summary>Show Plan</summary>

```


Terraform used the selected providers to generate the following execution
  + create

Terraform will perform the following actions:

  # module.dev-host-prjs["svc1"].module.ngfw_enterprise[0].google_network_security_security_profile.fw_sec_prof will be created
  + resource "google_network_security_security_profile" "fw_sec_prof" {
      + create_time      = (known after apply)
      + effective_labels = {
          + "goog-terraform-provisioned" = "true"
        }
      + etag             = (known after apply)
      + id               = (known after apply)
      + location         = "global"
      + name             = "secprof-nsp-threatprevention-1"
      + parent           = "organizations/872410903863"
      + self_link        = (known after apply)
      + terraform_labels = {
          + "goog-terraform-provisioned" = "true"
        }
      + type             = "THREAT_PREVENTION"
      + update_time      = (known after apply)
    }

  # module.dev-host-prjs["svc1"].module.ngfw_enterprise[0].google_network_security_security_profile_group.fw_sec_prof_group will be created
  + resource "google_network_security_security_profile_group" "fw_sec_prof_group" {
      + create_time               = (known after apply)
      + effective_labels          = {
          + "goog-terraform-provisioned" = "true"
        }
      + etag                      = (known after apply)
      + id                        = (known after apply)
      + location                  = "global"
      + name                      = "secprof-nsp-threatprevention-1-group"
      + parent                    = "organizations/872410903863"
      + terraform_labels          = {
          + "goog-terraform-provisioned" = "true"
        }
      + threat_prevention_profile = (known after apply)
      + update_time               = (known after apply)
    }

Plan: 2 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + sec_profile_group_id = (known after apply)

Warning: Value for undeclared variable

The root module does not declare a variable named "universe" but a value was

To silence these warnings, use TF_VAR_... environment variables to provide

Warning: Value for undeclared variable

The root module does not declare a variable named "tag_values" but a value

To silence these warnings, use TF_VAR_... environment variables to provide

Warning: Values for undeclared variables

In addition to the other similar warnings shown, 6 other variable(s) defined


Saved the plan to: ../plan.out

To perform exactly these actions, run the following command to apply:
    terraform apply "../plan.out"
```

</details>

### Terraform Apply `skipped`

*Pusher: @leorocca-gg, Action: `pull_request`, Working Directory: ``, Workflow: `FAST networking stage`*